Revit 2024 API
FaceSilhouetteNode Class
 An output node that represents a Face edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public class FaceSilhouetteNode : FaceDetailNode
Visual Basic
Public Class FaceSilhouetteNode _
	Inherits FaceDetailNode
Visual C++
public ref class FaceSilhouetteNode : public FaceDetailNode
Remarks
 See also: [!:Autodesk::Revit::DB::IExportContext2D::OnFaceSilhouette2D].
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceSilhouetteNode
See Also
FaceSilhouetteNode Members
Autodesk.Revit.DB Namespace